package day02;
//变量的演示
public class VarDemo {
	public static void main(String[] args) {
		/*
		 * 变量的练习:
		 * 1.声明一个整型变量，名为a
		 *   声明三个整型变量，名为b,c,d
		 * 2.声明整型变量e并直接赋值为250
		 *   声明整型变量f，
		 *     给变量f赋值为250
		 * 3.声明整型变量g并赋值为3.14---------???
		 *   声明整型变量h并赋值为10，
		 *     声明整型变量i并赋值为h+100，输出i的值
		 *     在h本身基础之上增100，输出h的值
		 *   输出m的值----------------------???
		 *   声明整型变量m，输出m的值----------???
		 * 4.声明几个正确的和几个错误的变量
		 */
		
		
		
		/*
		//4.变量的使用
		//  1)必须与数据类型匹配
		//  2)对变量的使用就是对它所存的那个数的使用
		//  3)变量在使用之前必须声明并初始化
		//int a=5.67; //编译错误，数据类型不匹配
		int b=5;    //声明整型变量b并赋值为5
		int c=b+10; //取出b的值5，加10后，再赋值给c
		b=b+10;     //取出b的值5，加10后，再赋值给b
		            //在b本身基础之上增10
		System.out.println(b); //输出b的值15
		System.out.println("b"); //输出b，原样输出
		//System.out.println(m); //编译错误，m未声明
		int m;
		//System.out.println(m); //编译错误，m未初始化
		*/
		
		/*
		//3.变量的初始化:第一次赋值
		int a=250; //声明的同时初始化，声明整型变量a并赋值为250
		int b; //声明整型变量b
		b=250; //先声明后初始化，给变量b赋值为250
		*/
		
		/*
		//2.变量的命名
		int a1,a_6$,_$;
		//int a*b; //编译错误，不能包含*号
		//int 1a; //编译错误，不能以数字开头
		//int m=250;
		//System.out.println(M); //编译错误，严格区分大小写
		//int class; //编译错误，不能使用关键字
		int a; //正确，但不建议
		int 年龄; //正确，但不建议
		int nianLing; //正确，但不建议
		int age; //建议"见名知意"
		int score,myScore,myJavaScore; //建议"驼峰命名法"
		*/
		
		/*
		//1.变量的声明:
		int a; //声明一个整型变量，名为a
		int b,c,d; //声明三个整型变量，名为b,c,d
		*/
	}
}















